{
    "title": "# Projet TikTok – Drones AR avec Pi",
    "subtitles": [
      {
        "sectionTitle": "Présentation",
        "content": "Ce projet consiste à créer une série de vidéos TikTok de 68 secondes chacune, présentant un personnage utilisant des lunettes AR et un drone virtuel. Le script comporte cinq scènes et inclut des fichiers multimédias associés."
      },
      {
        "sectionTitle": "Utilisation de GitHub",
        "content": "Nous utilisons GitHub pour gérer notre projet en suivant un système de branches de version pour chaque version de la vidéo. Ceci simplifie la collaboration et permet d'apporter des modifications sur plusieurs branches de la vidéo."
      },
      {
        "sectionTitle": "Script des vidéos",
        "content": "Le script du projet est accessible depuis le fichier `script.json`. Il présente une description détaillée de chaque scène et renvoie vers les fichiers multimédias correspondants."
      },
      {
        "sectionTitle": "Fichiers multimédias",
        "content": "Chaque scène dispose de fichiers multimédias hébergés sur le référentiel GitHub, composés de fichiers audio (MP3), vidéo (MP4) et texte (TXT). Les noms et liens de ces fichiers peuvent être trouvés dans le fichier `script.json`."
      }
    ],
    "scenes": [
        {
            "id": "scene1",
            "run": true,
            "time": "0-15 seconds",
            "timestamp": 1654481600,
            "audioFile": "audio_scene1.mp3",
            "videoFile": "video_scene1.mp4",
            "textFile": "text_scene1.txt",
            "description": "Présentation du role:user,name:Mike en Music avec des lunettes AR et l'appareil de contrôle de drone virtuel équipée d'une IA nomée IA Une intelligence artificielle dans ciel maîtrisons la cartographie le calcul quantique les approche métaphysique et les techniques d'apprentissage automatique dans le cloud computing."
            },
            {
            "id": "scene2",
            "run": true,
            "time": "16-25 seconds",
            "timestamp": 1654481610,
            "audioFile": "audio_scene2.mp3",
            "videoFile": "video_scene2.mp4",
            "textFile": "text_scene2.txt",
            "description": "Le personnage active les lunettes AR et le drone virtuel apparait..."
            },
            {
            "id": "scene3",
            "run": true,
            "time": "26-35 seconds",
            "timestamp": 1654481620,
            "audioFile": "audio_scene3.mp3",
            "videoFile": "video_scene3.mp4",
            "textFile": "text_scene3.txt",
            "description": "Le personnage contrôle le drone virtuel avec les lunettes AR pour accomplir une tâche particulière dans un [context] particulier (par exemple, inspection d'une structure). (e.g., inspecting a structure)."
            },
            {
            "id": "scene4",
            "run": true,
            "time": "36-55 seconds",
            "timestamp": 1654481630,
            "audioFile": "audio_scene4.mp3",
            "videoFile": "video_scene4.mp4",
            "textFile": "text_scene4.txt",
            "description": "Montrez comment le personnage utilise le drone virtuel en music pour accomplir la tâche avec des effets visuels impressionnants grâce aux lunettes AR."
            },
            {
            "id": "scene5",
            "run": true,
            "time": "56-68 seconds",
            "timestamp": 1654481640,
            "audioFile": "audio_scene5.mp3",
            "videoFile": "video_scene5.mp4",
            "textFile": "text_scene5.txt",
            "description": "Le personnage réussit sa tâche et fait un clin d'œil à la caméra, suivi de l'apparition d'un message incitant les spectateurs à découvrir les technologies AR et les drones virtuels.."
            }
            ]
  }